RESTcrud/app/controllers/media_api_controller.rb

  def index
    @media = Media.all
---
SELECT `Media`.* FROM `Media`

  def create
    data = JSON.parse(request.body.read)
    @medium = Media.new
    @medium.build_location
    @medium.build_fuzzyDate
    populateOrUpdateMedia(@medium, data)

    if @medium.save
---
INSERT INTO `Fuzzy_Date` (`accuracy`, `day`, `day_name`, `day_part`, `decade`, `exact_date`, `hour`, `locale`, `minute`, `month`, `season`, `second`, `start`, `textual_date`, `time_interval_id_temp`, `year`) VALUES (NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL)
INSERT INTO `Location` (`accuracy`, `city`, `continent`, `coordinates_trust`, `country`, `description`, `environment`, `lat`, `locale`, `location_textual`, `location_type_id`, `lon`, `map_url`, `name`, `neighborhood`, `radius`, `region`, `street`, `street_number`) VALUES (NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL)
INSERT INTO `Media` (`caption`, `fuzzy_enddate`, `fuzzy_startdate`, `is_public`, `last_update`, `locale`, `location_id`, `media_type`, `media_url`, `source`, `source_url`, `text`) VALUES (NULL, NULL, 11794, NULL, NULL, NULL, 1060, NULL, NULL, NULL, NULL, NULL)

  def show
    @medium = Media.find(params[:id], :include => [:location, :fuzzyDate])
---
SELECT `Fuzzy_Date`.* FROM `Fuzzy_Date` WHERE `Fuzzy_Date`.`fuzzy_date_id` IN (11002)
SELECT `Location`.* FROM `Location` WHERE `Location`.`location_id` IN (881)
SELECT `Media`.* FROM `Media` WHERE `Media`.`media_id` = 400 LIMIT 1

  def update
    data = JSON.parse(request.body.read)
    @medium = Media.find(params[:id], :include => [:location, :fuzzyDate])

    populateOrUpdateMedia(@medium,data)

    if @medium.save
---
SELECT `Fuzzy_Date`.* FROM `Fuzzy_Date` WHERE `Fuzzy_Date`.`fuzzy_date_id` IN (11804)
SELECT `Location`.* FROM `Location` WHERE `Location`.`location_id` IN (1070)
SELECT `Media`.* FROM `Media` WHERE `Media`.`media_id` = 560 LIMIT 1
UPDATE `Media` SET `media_url` = 'ciao.it modificato', `source` = NULL WHERE `Media`.`media_id` = 560