RESTcrud/app/controllers/media_controller.rb

SELECT `Media`.* FROM `Media`
---
  def list
    @media = Media.all

INSERT INTO `Fuzzy_Date` (`accuracy`, `day`, `day_name`, `day_part`, `decade`, `exact_date`, `hour`, `locale`, `minute`, `month`, `season`, `second`, `start`, `textual_date`, `time_interval_id_temp`, `year`) VALUES ('', NULL, '', '', NULL, NULL, NULL, '', NULL, NULL, '', NULL, NULL, '889', NULL, NULL)
INSERT INTO `Location` (`accuracy`, `city`, `continent`, `coordinates_trust`, `country`, `description`, `environment`, `lat`, `locale`, `location_textual`, `location_type_id`, `lon`, `map_url`, `name`, `neighborhood`, `radius`, `region`, `street`, `street_number`) VALUES (NULL, '', NULL, NULL, '', '', NULL, NULL, '', '889', NULL, NULL, NULL, '', NULL, NULL, '', NULL, NULL)
INSERT INTO `Media` (`caption`, `fuzzy_enddate`, `fuzzy_startdate`, `is_public`, `last_update`, `locale`, `location_id`, `media_type`, `media_url`, `source`, `source_url`, `text`) VALUES (NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL)
---
  def create
    @medium = Media.new
    @medium.build_location
    @medium.build_fuzzyDate
    populateOrUpdateMedia(@medium, params[:media])

    if @medium.save

SELECT `Fuzzy_Date`.* FROM `Fuzzy_Date` WHERE `Fuzzy_Date`.`fuzzy_date_id` IN (10608)
SELECT `Location`.* FROM `Location` WHERE `Location`.`location_id` IN (487)
SELECT `Media`.* FROM `Media` WHERE `Media`.`media_id` = 1 LIMIT 1
---
  def edit
    @medium = Media.find(params[:id], :include => [:location, :fuzzyDate])

SELECT `Fuzzy_Date`.* FROM `Fuzzy_Date` WHERE `Fuzzy_Date`.`fuzzy_date_id` IN (10638)
SELECT `Location`.* FROM `Location` WHERE `Location`.`location_id` IN (517)
SELECT `Media`.* FROM `Media` WHERE `Media`.`media_id` = 15 LIMIT 1
UPDATE `Fuzzy_Date` SET `textual_date` = '', `season` = '' WHERE `Fuzzy_Date`.`fuzzy_date_id` = 10638
UPDATE `Location` SET `description` = 'mona' WHERE `Location`.`location_id` = 517
UPDATE `Media` SET `text` = 'da cancellare, non c\'entra' WHERE `Media`.`media_id` = 15
---
  def update
    @medium = Media.find(params[:id], :include => [:location, :fuzzyDate])

    populateOrUpdateMedia(@medium,params[:media])

    if @medium.save